src/InformationRegisters/ФотографииДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ФотографииДня</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ФотографииДня/Ext/ManagerModule.bsl
Функция ЗаписатьЗначение(Дата, ддКартинка, Описание) Экспорт

	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата = Дата;
	МенеджерЗаписи.ИД = Новый УникальныйИдентификатор;
	
	МенеджерЗаписи.Картинка = Новый ХранилищеЗначения(ддКартинка);
	МенеджерЗаписи.Описание = Описание;
	
	МенеджерЗаписи.Записать();
		
КонецФункции
 
Функция ПрочитатьЗначение(Пользователь, Дата, ИД = Неопределено) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотографииДня.Пользователь,
		|	ФотографииДня.Дата,
		|	ФотографииДня.ИД,
		|	ФотографииДня.Картинка КАК ДанныеКартинки,
		|	ФотографииДня.Описание
		|ИЗ
		|	РегистрСведений.ФотографииДня КАК ФотографииДня
		|ГДЕ
		|	ФотографииДня.Пользователь = &Пользователь
		|	И ФотографииДня.Дата = &Дата";
		
	Если ИД <> Неопределено Тогда
	
		Запрос.Текст = Запрос.Текст + " И ФотографииДня.ИД = &ИД";
		Запрос.УстановитьПараметр("ИД", ИД);
		
	КонецЕсли; 
		
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Таблица = РезультатЗапроса.Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Возврат Новый Структура("Пользователь, Дата, ИД, ДанныеКартинки, Описание",
			Таблица[0].Пользователь, Таблица[0].Дата, Таблица[0].ИД, Таблица[0].ДанныеКартинки, Таблица[0].Описание);
	Иначе
		Возврат Таблица;
	КонецЕсли; 
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
КонецФункции
